===================
Define Micro
===================

#define _Vpass_ 8.0
#define _dt_    2.0e-4
#define _trise_ false
#define _test_  true
#define _at_reference_ @node|test@
#define _test_string_ "test"
#define _test_string_ "@test@"

---

(source_file
  (sharp_command_statement
    (define_micro
      name: (identifier)
      value: (number)))
  (sharp_command_statement
    (define_micro
      name: (identifier)
      value: (number)))
  (sharp_command_statement
    (define_micro
      name: (identifier)
      value: (boolean)))
  (sharp_command_statement
    (define_micro
      name: (identifier)
      value: (boolean)))
  (sharp_command_statement
    (define_micro
      name: (identifier)
      value: (at_reference)))
  (sharp_command_statement
    (define_micro
      name: (identifier)
      value: (string
        (string_fragment))))
  (sharp_command_statement
    (define_micro
      name: (identifier)
      value: (string
        (at_reference)))))

===================
Undefine Micro
===================

#undef _Vpass_
#undef _dt_
#undef _trise_
#undef _test_
#undef _at_reference_
#undef _test_string_
#undef _test_string_ #comment

---

(source_file
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (comment))

===================
Set Dependency
===================

#setdep @node|test@

---

(source_file
  (sharp_command_statement
    (set_dep
      (at_reference))))

===================
Comment
===================

#test comment

---

(source_file
  (comment))
