===================
Define Micro
===================

#define _Vpass_ 8.0
#define _dt_    2.0e-4
#define _trise_ false
#define _test_  true
#define _at_reference_ @node|test@
#define _test_string_ "test"
#define _test_string_with_at_ "@test@"
#define _angle_ @<1+2>@
#define with_comment 123 # this is a comment

---

(source_file
  (sharp_command_statement
    (define_micro
      (sharp_command_name)
      name: (identifier)
      value: (number)))
  (sharp_command_statement
    (define_micro
      (sharp_command_name)
      name: (identifier)
      value: (number)))
  (sharp_command_statement
    (define_micro
      (sharp_command_name)
      name: (identifier)
      value: (boolean)))
  (sharp_command_statement
    (define_micro
      (sharp_command_name)
      name: (identifier)
      value: (boolean)))
  (sharp_command_statement
    (define_micro
      (sharp_command_name)
      name: (identifier)
      value: (at_reference)))
  (sharp_command_statement
    (define_micro
      (sharp_command_name)
      name: (identifier)
      value: (string
        (string_fragment))))
  (sharp_command_statement
    (define_micro
      (sharp_command_name)
      name: (identifier)
      value: (string
        (at_reference))))
  (sharp_command_statement
    (define_micro
      (sharp_command_name)
      name: (identifier)
      value: (at_angle_expression
        (binop_expr
          (number)
          (number)))))
  (sharp_command_statement
    (define_micro
      (sharp_command_name)
      name: (identifier)
      value: (number)))
  (comment))

===================
Undefine Micro
===================

#undef _Vpass_
#undef _dt_
#undef _trise_
#undef _test_
#undef _at_reference_
#undef _test_string_
#undef _test_string_with_at_ #comment
#undef another_one # another one

---

(source_file
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (comment)
  (sharp_command_statement
    (undefine_macro
      name: (identifier)))
  (comment))

===================
Set Dependency
===================

#setdep @node|test@
#setdep @another|dep@ # with comment

---

(source_file
  (sharp_command_statement
    (set_dep
      (at_reference)))
  (sharp_command_statement
    (set_dep
      (at_reference)))
  (comment))

===================
Comment only
===================

#test comment
# this is a standalone comment
## another one

---

(source_file
  (comment)
  (comment)
  (comment))
